000000*/*
000000* CSCI3180 Principles of Programming Languages
000000*
000000* --- Declaration ---
000000*
000000* I declare that the assignment here submitted is original except for source
000000* material explicitly acknowledged. I also acknowledge that I am aware of
000000* University policy and regulations on honesty in academic work, and of the
000000* disciplinary guidelines and procedures applicable to breaches of such policy
000000* and regulations, as contained in the website
000000* http://www.cuhk.edu.hk/policy/academichonesty/
000000*
000000* Assignment 1
000000* Name : SETO TSZ KIN
000000* Student ID : 1155092585
000000* Email Addr : 1155092585@link.cuhk.edu.hk
000000**/
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. EX-1.
000000 ENVIRONMENT DIVISION.
000000 INPUT-OUTPUT SECTION.
000000 FILE-CONTROL.
000000     SELECT EMPLOYEE-INPUT-FILE ASSIGN TO 'employees.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS EMPLOYEE-FS.
000000     SELECT MONTHLY-INPUT-FILE ASSIGN TO 'monthly-attendance.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS MONTHLY-IN-FS.
000000     SELECT MONTHLY-OUTPUT-FILE ASSIGN TO
000000-'monthly-attendancecob.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS MONTHLY-OUT-FS.
000000     SELECT ATTENDANCE-INPUT-FILE ASSIGN TO 'attendance.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS ATTENDANCE-IN-FS.
000000     SELECT ATTENDANCE-OUTPUT-FILE ASSIGN TO 'attendance-sort.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS ATTENDANCE-OUT-FS.
000000     SELECT ATTENDANCE-WORK-FILE ASSIGN TO 'temp.txt'.
000000     SELECT SUMMARY-OUTPUT-FILE ASSIGN TO 'summarycob.txt'
000000         ORGANIZATION IS LINE SEQUENTIAL
000000         FILE STATUS IS SUMMARY-OUT-FS.
000000 DATA DIVISION.
000000 FILE SECTION.
000000 FD EMPLOYEE-INPUT-FILE.
000000 01 EMPLOYEE-RECORD.
000000     05 STAFF-NUMBER PIC 9(4).
000000     05 EMPLOYEE-NAME.
000000         10 EMPLOYEE-LAST-NAME PIC X(10).
000000         10 EMPLOYEE-FIRST-NAME PIC X(20).
000000     05 GENDER PIC A.
000000     05 DATE-OF-BIRTH.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000     05 HIRING-DATE.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000     05 DEPARTMENT PIC AAA.
000000     05 MONTHLY-SALARY PIC 9(6).
000000 FD MONTHLY-INPUT-FILE.
000000 01 ATTENDANCE-MONTH.
000000     05 YYYY PIC 9999.
000000     05 FILLER PIC X VALUE '-'.
000000     05 MM PIC 99.
000000 01 SUMMARY-RECORD.
000000     05 SUMMARY-STAFF-NUMBER PIC 9(4).
000000     05 SUMMARY-ABSENT PIC 9(3).
000000     05 SUMMARY-LATE PIC 9(3).
000000     05 SUMMARY-OVERTIME PIC 9(3).
000000 FD MONTHLY-OUTPUT-FILE.
000000 01 ATTENDANCE-MONTH.
000000     05 YYYY PIC 9999.
000000     05 FILLER PIC X VALUE '-'.
000000     05 MM PIC 99.
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMARY-RECORD.
000000     05 SUMMARY-STAFF-NUMBER PIC 9(4).
000000     05 SUMMARY-ABSENT PIC 9(3).
000000     05 SUMMARY-LATE PIC 9(3).
000000     05 SUMMARY-OVERTIME PIC 9(3).
000000     05 PIC X VALUE X'0D'.
000000 FD ATTENDANCE-INPUT-FILE.
000000 01 ATTENDANCE-DATE.
000000     05 YYYY PIC 9999.
000000     05 FILLER PIC X VALUE '-'.
000000     05 MM PIC 99.
000000     05 FILLER PIC X VALUE '-'.
000000     05 DD PIC 99.
000000 01 ATTENDANCE-RECORD.
000000     05 ATTENDANCE-STAFF-NUMBER PIC 9(4).
000000     05 ATTENDANCE-STATUS PIC A(6).
000000     05 ATTENDANCE-TIME-STAMP.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 HOUR PIC 99.
000000         10 FILLER PIC X VALUE ':'.
000000         10 MINUTE PIC 99.
000000 FD ATTENDANCE-OUTPUT-FILE.
000000 01 ATTENDANCE-DATE.
000000     05 YYYY PIC 9999.
000000     05 FILLER PIC X VALUE '-'.
000000     05 MM PIC 99.
000000     05 FILLER PIC X VALUE '-'.
000000     05 DD PIC 99.
000000 01 ATTENDANCE-RECORD.
000000     05 ATTENDANCE-STAFF-NUMBER PIC 9(4).
000000     05 ATTENDANCE-STATUS PIC A(6).
000000     05 ATTENDANCE-TIME-STAMP.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 HOUR PIC 99.
000000         10 FILLER PIC X VALUE ':'.
000000         10 MINUTE PIC 99.
000000 SD ATTENDANCE-WORK-FILE.
000000 01 ATTENDANCE-RECORD-BUFF.
000000     05 ATTENDANCE-STAFF-NUMBER-BUFF PIC 9(4).
000000     05 FILLER PIC A(6).
000000     05 FILLER PIC X(16).
000000 FD SUMMARY-OUTPUT-FILE
000000     DATA RECORD IS SUMMARY-OUT.
000000 01 SUMMARY-OUT PIC X(80).
000000 WORKING-STORAGE SECTION.
000000 01 WS-EMPLOYEE-RECORD.
000000     05 WS-STAFF-NUMBER PIC 9(4).
000000     05 WS-EMPLOYEE-NAME.
000000         10 WS-EMPLOYEE-LAST-NAME PIC X(10).
000000         10 WS-EMPLOYEE-FIRST-NAME PIC X(20).
000000     05 WS-GENDER PIC A.
000000     05 WS-DATE-OF-BIRTH.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000     05 WS-HIRING-DATE.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000     05 WS-DEPARTMENT PIC AAA.
000000     05 WS-MONTHLY-SALARY PIC 9(6).
000000 01 WS-REPORT-RECORD.
000000     05 WS-STAFF-NUMBER PIC 9(4).
000000     05 PIC X(5) VALUE SPACE.
000000     05 WS-STAFF-NAME.
000000         10 WS-STAFF-LAST-NAME PIC X(10).
000000         10 PIC X VALUE SPACE.
000000         10 WS-STAFF-FIRST-NAME PIC X(20).
000000     05 PIC X VALUE SPACE.
000000     05 WS-STAFF-DEPARTMENT PIC AAA.
000000     05 PIC X(8) VALUE SPACE.
000000     05 WS-STAFF-STATUS PIC A(10).
000000     05 PIC X VALUE X'0D'.
000000 01 WS-ATTENDANCE-MONTH.
000000     05 Y PIC 9(4).
000000     05 HI PIC X.
000000     05 M PIC 9(2).
000000     05 PIC X VALUE X'0D'.
000000 01 WS-SUMMARY-RECORD.
000000     05 WS-SUMMARY-STAFF-NUMBER PIC 9(4).
000000     05 WS-SUMMARY-ABSENT PIC 9(3).
000000     05 WS-SUMMARY-LATE PIC 9(3).
000000     05 WS-SUMMARY-OVERTIME PIC 9(3).
000000     05 PIC X VALUE X'0D'.
000000 01 WS-SUMMARY-RECORD-TEMP.
000000     05 WS-SUMMARY-STAFF-NUMBER PIC 9(4).
000000     05 WS-SUMMARY-ABSENT PIC 9(3).
000000     05 WS-SUMMARY-LATE PIC 9(3).
000000     05 WS-SUMMARY-OVERTIME PIC 9(3).
000000     05 PIC X VALUE X'0D'.
000000 01 WS-ATTENDANCE-DATE.
000000     05 YYYY PIC 9999.
000000     05 FILLER PIC X VALUE '-'.
000000     05 MM PIC 99.
000000     05 FILLER PIC X VALUE '-'.
000000     05 DD PIC 99.
000000 01 WS-ATTENDANCE-RECORD-1.
000000     05 WS-ATTENDANCE-STAFF-NUMBER PIC 9(4).
000000     05 WS-ATTENDANCE-STATUS PIC A(6).
000000     05 WS-ATTENDANCE-TIME-STAMP.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 HOUR PIC 99.
000000         10 FILLER PIC X VALUE ':'.
000000         10 MINUTE PIC 99.
000000 01 WS-ATTENDANCE-RECORD-2.
000000     05 WS-ATTENDANCE-STAFF-NUMBER PIC 9(4).
000000     05 WS-ATTENDANCE-STATUS PIC A(6).
000000     05 WS-ATTENDANCE-TIME-STAMP.
000000         10 YYYY PIC 9999.
000000         10 FILLER PIC X VALUE '-'.
000000         10 MM PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 DD PIC 99.
000000         10 FILLER PIC X VALUE '-'.
000000         10 HOUR PIC 99.
000000         10 FILLER PIC X VALUE ':'.
000000         10 MINUTE PIC 99.
000000 01 WS-ATTENDANCE-START PIC 9 VALUE 0.
000000 01 WS-ATTENDANCE-END PIC 9 VALUE 0.
000000 01 WS-ATTENDANCE-SUSPICIOUS PIC 9 VALUE 0.
000000 01 WS-ATTENDANCE-LATE PIC 999 VALUE 000.
000000 01 WS-ATTENDANCE-ABSENT PIC 999 VALUE 000.
000000 01 WS-ATTENDANCE-OVERTIME PIC 999 VALUE 000.
000000 01 WS-REPORT-STATUS-WRITTEN PIC 9 VALUE 0.
000000 01 WS-NEW-MONTH PIC 9 VALUE 0.
000000 01 WS-FILE-END PIC 99 VALUE 10.
000000 01 EMPLOYEE-FS PIC X(2).
000000 01 MONTHLY-IN-FS PIC X(2).
000000 01 MONTHLY-OUT-FS PIC X(2).
000000 01 ATTENDANCE-IN-FS PIC X(2).
000000 01 ATTENDANCE-OUT-FS PIC X(2).
000000 01 SUMMARY-OUT-FS PIC X(2).
000000 01 SUSPICIOUS-COUNT PIC 9(4) VALUE 0000.
000000 01 PRESENT-COUNT PIC 9(4) VALUE 0000.
000000 01 ABSENT-COUNT PIC 9(4) VALUE 0000.
000000 01 LATE-COUNT PIC 9(4) VALUE 0000.
000000 01 SUMMERY-TITLE.
000000     05 PIC X(24) VALUE 'Daily Attendance Summary'.
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMERY-DATE.
000000     05 SUMMERY-DATE-CONTENT PIC X(24).
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMERY-DATE-TEMP.
000000     05 M PIC X(9).
000000     05 D PIC XX.
000000     05 Y PIC 9999.
000000 01 SUMMERY-HEADER.
000000     05 PIC X(13) VALUE 'Staff-ID Name'.
000000     05 PIC X(28) VALUE SPACE.
000000     05 PIC X(17) VALUE 'Department Status'.
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMERY-SEPERATOR.
000000     05 PIC X OCCURS 62 TIMES VALUE '-'.
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMERY-PRESENT-COUNT.
000000     05 PIC X(21) VALUE 'Number of Presences: '.
000000     05 PRESENT-COUNT-REPORT PIC ZZZ9.
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMERY-ABSENT-COUNT.
000000     05 PIC X(20) VALUE 'Number of Absences: '.
000000     05 ABSENT-COUNT-REPORT PIC ZZZ9.
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMERY-LATE-COUNT.
000000     05 PIC X(25) VALUE 'Number of Late Arrivals: '.
000000     05 LATE-COUNT-REPORT PIC ZZZ9.
000000     05 PIC X VALUE X'0D'.
000000 01 SUMMERY-SUSPICIOUS-COUNT.
000000     05 PIC X(30) VALUE 'Number of Suspicious Records: '.
000000     05 SUSPICIOUS-COUNT-REPORT PIC ZZZ9.
000000     05 PIC X VALUE X'0D'.
000000 PROCEDURE DIVISION.
000000 MAIN-PARAGRAPH.
000000     PERFORM ATTENDANCE-SORT.
000000     OPEN INPUT EMPLOYEE-INPUT-FILE.
000000     OPEN INPUT MONTHLY-INPUT-FILE.
000000     OPEN OUTPUT MONTHLY-OUTPUT-FILE.
000000     OPEN OUTPUT SUMMARY-OUTPUT-FILE.
000000     OPEN INPUT ATTENDANCE-OUTPUT-FILE.
000000     PERFORM PREPROCESS.
000000     READ EMPLOYEE-INPUT-FILE INTO WS-EMPLOYEE-RECORD.
000000*    DISPLAY '    NEXT EMPLOYEE:'WS-EMPLOYEE-RECORD.
000000*    DISPLAY '    EMPLOYEE FILE STATUS:'EMPLOYEE-FS.
000000     IF EMPLOYEE-FS NOT = WS-FILE-END AND EMPLOYEE-FS NOT = 46
000000         PERFORM UPDATE-ATTENDANCE
000000     END-IF.
000000     PERFORM PROPROCESS.
000000     CLOSE EMPLOYEE-INPUT-FILE.
000000     CLOSE MONTHLY-INPUT-FILE.
000000     CLOSE MONTHLY-OUTPUT-FILE.
000000     CLOSE SUMMARY-OUTPUT-FILE.
000000     CLOSE ATTENDANCE-OUTPUT-FILE.
000000     STOP RUN.
000000*******************************************
000000*0TH
000000*PREPROCESS
000000*
000000 PREPROCESS.
000000     PERFORM READ-MONTHLY-FIRST-LINE.
000000     PERFORM WRITE-MONTHLY-FIRST-LINE.
000000     PERFORM GENERATE-DATE.
000000     PERFORM WRITE-SUMMARY-HEADER.
000000 READ-MONTHLY-FIRST-LINE.
000000     READ MONTHLY-INPUT-FILE INTO WS-ATTENDANCE-MONTH.
000000     IF M OF WS-ATTENDANCE-MONTH NOT = MM OF WS-ATTE
000000-NDANCE-DATE
000000       MOVE 1 TO WS-NEW-MONTH
000000       IF Y OF WS-ATTENDANCE-MONTH NOT = YYYY OF WS-ATTE
000000-NDANCE-DATE
000000         MOVE YYYY OF WS-ATTENDANCE-DATE TO Y OF WS-ATTE
000000-NDANCE-MONTH
000000       END-IF
000000       MOVE MM OF WS-ATTENDANCE-DATE TO M OF WS-ATT
000000-ENDANCE-MONTH
000000     END-IF.
000000 WRITE-MONTHLY-FIRST-LINE.
000000     WRITE ATTENDANCE-MONTH OF MONTHLY-OUTPUT-FILE FROM WS-ATTENDA
000000-NCE-MONTH.
000000 GENERATE-DATE.
000000     MOVE YYYY OF WS-ATTENDANCE-DATE TO Y OF SUMMERY-DATE-TEMP.
000000     IF MM OF WS-ATTENDANCE-DATE = 1
000000         MOVE 'January' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 2
000000         MOVE 'February' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 3
000000         MOVE 'March' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 4
000000         MOVE 'April' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 5
000000         MOVE 'May' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 6
000000         MOVE 'June' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 7
000000         MOVE 'July' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 8
000000         MOVE 'August' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 9
000000         MOVE 'September' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 10
000000         MOVE 'October' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 11
000000         MOVE 'November' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     IF MM OF WS-ATTENDANCE-DATE = 12
000000         MOVE 'December' TO M OF SUMMERY-DATE-TEMP
000000     END-IF.
000000     MOVE DD OF WS-ATTENDANCE-DATE TO D OF SUMMERY-DATE-TEMP.
000000     IF DD OF WS-ATTENDANCE-DATE >= 10
000000         STRING 'Date: ' DELIMITED BY 6
000000                M OF SUMMERY-DATE-TEMP DELIMITED BY SPACE
000000                ' ' DELIMITED BY SIZE
000000                D OF SUMMERY-DATE-TEMP DELIMITED BY SPACE
000000                ', ' DELIMITED BY SIZE
000000                Y OF SUMMERY-DATE-TEMP DELIMITED BY SIZE
000000                INTO SUMMERY-DATE-CONTENT OF SUMMERY-DATE
000000         END-STRING
000000     END-IF.
000000     IF DD OF WS-ATTENDANCE-DATE < 10
000000         STRING 'Date: ' DELIMITED BY 6
000000                M OF SUMMERY-DATE-TEMP DELIMITED BY SPACE
000000                ' ' DELIMITED BY SIZE
000000                D OF SUMMERY-DATE-TEMP (2:1) DELIMITED BY SPACE
000000                ', ' DELIMITED BY SIZE
000000                Y OF SUMMERY-DATE-TEMP DELIMITED BY SIZE
000000                INTO SUMMERY-DATE-CONTENT OF SUMMERY-DATE
000000         END-STRING
000000     END-IF.
000000 WRITE-SUMMARY-HEADER.
000000     WRITE SUMMARY-OUT FROM SUMMERY-TITLE.
000000     WRITE SUMMARY-OUT FROM SUMMERY-DATE.
000000     WRITE SUMMARY-OUT FROM SUMMERY-HEADER.
000000     WRITE SUMMARY-OUT FROM SUMMERY-SEPERATOR.
000000*
000000*0TH
000000*PREPROCESS END
000000*******************************************
000000*******************************************
000000*1ST
000000*SORTING ATTENDANCE
000000*
000000 ATTENDANCE-SORT.
000000     SORT ATTENDANCE-WORK-FILE
000000     ON ASCENDING KEY ATTENDANCE-STAFF-NUMBER-BUFF
000000     INPUT PROCEDURE IS ATTENDANCE-SORT-IN
000000     GIVING ATTENDANCE-OUTPUT-FILE.
000000 ATTENDANCE-SORT-IN.
000000     OPEN INPUT ATTENDANCE-INPUT-FILE.
000000     PERFORM SORT-ATTENDANCE-FIRST-LINE.
000000     PERFORM SORT-ATTENDANCE.
000000     CLOSE ATTENDANCE-INPUT-FILE.
000000 SORT-ATTENDANCE-FIRST-LINE.
000000     READ ATTENDANCE-INPUT-FILE INTO WS-ATTENDANCE-DATE.
000000 SORT-ATTENDANCE.
000000     READ ATTENDANCE-INPUT-FILE INTO ATTENDANCE-RECORD-BUFF.
000000     IF ATTENDANCE-IN-FS NOT = WS-FILE-END
000000         RELEASE ATTENDANCE-RECORD-BUFF
000000         GO TO SORT-ATTENDANCE
000000     END-IF.
000000*
000000*1ST
000000*SORTING ATTENDANCE END
000000*******************************************
000000*******************************************
000000*2ND
000000*UPDATING ATTENDANCE
000000*
000000 UPDATE-ATTENDANCE.
000000     IF WS-ATTENDANCE-ABSENT = 0 AND WS-ATTENDANCE-SUSPICIOUS = 0
000000         PERFORM UPDATE-ATTENDANCE-RECORD
000000     END-IF.
000000     MOVE 0 TO WS-ATTENDANCE-ABSENT.
000000     IF WS-ATTENDANCE-SUSPICIOUS = 1
000000         MOVE WS-ATTENDANCE-RECORD-2 TO WS-ATTENDANCE-RECORD-1
000000         PERFORM UPDATE-ATTENDANCE-RECORD-2
000000     END-IF.
000000     MOVE 0 TO WS-ATTENDANCE-SUSPICIOUS.
000000*    DISPLAY '    REC1:' WS-ATTENDANCE-RECORD-1.
000000*    DISPLAY '    REC2:' WS-ATTENDANCE-RECORD-2.
000000     PERFORM CHECK-ATTENDENCE.
000000*    DISPLAY '    SUSPICIOUS:' WS-ATTENDANCE-SUSPICIOUS.
000000*    DISPLAY '    ABSENT:' WS-ATTENDANCE-ABSENT.
000000     PERFORM CALCUALTE-ATTENDENCE.
000000****NEED TO DEAL WITH 2A(1 3A(2 4A CASE
000000****WS-ATTENDANCE-SUSPICIOUS = 1 need swap
000000 UPDATE-ATTENDANCE-RECORD.
000000     PERFORM UPDATE-ATTENDANCE-RECORD-1.
000000     PERFORM UPDATE-ATTENDANCE-RECORD-2.
000000 UPDATE-ATTENDANCE-RECORD-1.
000000     IF WS-ATTENDANCE-END NOT = 1
000000         READ ATTENDANCE-OUTPUT-FILE INTO WS-ATTENDANCE-RECORD-1
000000     END-IF.
000000     IF ATTENDANCE-OUT-FS = WS-FILE-END OR ATTENDANCE-OUT-FS = 46
000000         MOVE 1 TO WS-ATTENDANCE-END
000000     END-IF.
000000     IF WS-ATTENDANCE-END NOT = 1
000000         IF WS-ATTENDANCE-START NOT = 0
000000             IF WS-ATTENDANCE-STAFF-NUMBER OF WS-ATTENDANCE-RECORD
000000--2 = WS-ATTENDANCE-STAFF-NUMBER OF WS-ATTENDANCE-RECORD-1
000000                 GO TO UPDATE-ATTENDANCE-RECORD-1
000000             END-IF
000000         END-IF
000000     END-IF.
000000     IF WS-ATTENDANCE-START = 0
000000         MOVE 1 TO WS-ATTENDANCE-START
000000     END-IF.
000000 UPDATE-ATTENDANCE-RECORD-2.
000000     IF WS-ATTENDANCE-END NOT = 1
000000         READ ATTENDANCE-OUTPUT-FILE INTO WS-ATTENDANCE-RECORD-2
000000     END-IF.
000000     IF ATTENDANCE-OUT-FS = WS-FILE-END OR ATTENDANCE-OUT-FS = 46
000000         MOVE 1 TO WS-ATTENDANCE-END
000000     END-IF.
000000     IF WS-ATTENDANCE-END NOT = 1
000000         IF WS-ATTENDANCE-STAFF-NUMBER OF WS-ATTENDANCE-RECORD-2 =
000000- WS-ATTENDANCE-STAFF-NUMBER OF WS-ATTENDANCE-RECORD-1
000000             IF WS-ATTENDANCE-STATUS OF WS-ATTENDANCE-RECORD-2  =
000000-'ARRIVE'
000000                 GO TO UPDATE-ATTENDANCE-RECORD-2
000000             END-IF
000000         END-IF
000000     END-IF.
000000 CHECK-ATTENDENCE.
000000     IF WS-ATTENDANCE-STAFF-NUMBER OF WS-ATTENDANCE-RECORD-2 N
000000-OT = WS-STAFF-NUMBER OF WS-EMPLOYEE-RECORD AND WS-ATTENDANCE-STAF
000000-F-NUMBER OF WS-ATTENDANCE-RECORD-1 NOT = WS-STAFF-NUMBER OF WS-EM
000000-PLOYEE-RECORD
000000         MOVE 1 TO WS-ATTENDANCE-ABSENT
000000     END-IF.
000000     IF WS-ATTENDANCE-ABSENT NOT = 1
000000         IF WS-ATTENDANCE-STAFF-NUMBER OF WS-ATTENDANCE-RECORD-2 N
000000-OT = WS-ATTENDANCE-STAFF-NUMBER OF WS-ATTENDANCE-RECORD-1
000000             MOVE 1 TO WS-ATTENDANCE-SUSPICIOUS
000000         END-IF
000000     END-IF.
000000*
000000*2ND
000000*UPDATING ATTENDANCE END
000000*******************************************
000000*******************************************
000000*3RD
000000*CALCUALTE ATTENDENCE
000000*
000000 CALCUALTE-ATTENDENCE.
000000     IF WS-ATTENDANCE-SUSPICIOUS = 1 AND WS-ATTENDANCE-ABSENT = 0
000000         PERFORM CAL-SUSPICIOUS
000000     END-IF.
000000     IF WS-ATTENDANCE-SUSPICIOUS = 0 AND WS-ATTENDANCE-ABSENT = 0
000000         PERFORM CAL-LATE
000000         PERFORM CAL-OVERTIME
000000     END-IF.
000000     PERFORM MAKE-ATTENDANCE.
000000 CAL-SUSPICIOUS.
000000     MOVE 0 TO WS-ATTENDANCE-LATE.
000000     MOVE 0 TO WS-ATTENDANCE-OVERTIME.
000000 CAL-LATE.
000000     COMPUTE WS-ATTENDANCE-LATE = ((HOUR OF WS-ATTENDANCE-TIME-STA
000000-MP OF WS-ATTENDANCE-RECORD-1 - 10) * 60 + MINUTE OF WS-ATTENDANCE
000000--TIME-STAMP OF WS-ATTENDANCE-RECORD-1) / 15.
000000 CAL-OVERTIME.
000000     COMPUTE WS-ATTENDANCE-OVERTIME = HOUR OF WS-ATTENDANCE-TIME-S
000000-TAMP OF WS-ATTENDANCE-RECORD-2 - 17.
000000*
000000*3RD
000000*CALCUALTE ATTENDENCE END
000000*******************************************
000000*******************************************
000000*4TH
000000*GENERATE ATTENDENCE
000000 MAKE-ATTENDANCE.
000000     PERFORM READ-MONTHLY.
000000     PERFORM WRITE-ATTENDANCE.
000000     PERFORM MAKE-SUMMARY.
000000 READ-MONTHLY.
000000     READ MONTHLY-INPUT-FILE INTO WS-SUMMARY-RECORD.
000000     IF WS-NEW-MONTH = 1
000000       MOVE 0 TO WS-SUMMARY-ABSENT OF WS-SUMMARY-RECORD
000000       MOVE 0 TO WS-SUMMARY-LATE OF WS-SUMMARY-RECORD
000000       MOVE 0 TO WS-SUMMARY-OVERTIME OF WS-SUMMARY-RECORD
000000     END-IF.
000000 WRITE-ATTENDANCE.
000000     ADD WS-ATTENDANCE-LATE TO WS-SUMMARY-LATE OF WS-SUMMARY-R
000000-ECORD GIVING WS-SUMMARY-LATE OF WS-SUMMARY-RECORD-TEMP.
000000     ADD WS-ATTENDANCE-ABSENT TO WS-SUMMARY-ABSENT OF WS-SUMMA
000000-RY-RECORD GIVING WS-SUMMARY-ABSENT OF WS-SUMMARY-RECORD-TEMP.
000000     ADD WS-ATTENDANCE-OVERTIME TO WS-SUMMARY-OVERTIME OF WS-S
000000-UMMARY-RECORD GIVING WS-SUMMARY-OVERTIME OF WS-SUMMARY-RECORD-TEM
000000-P.
000000     IF WS-SUMMARY-OVERTIME OF WS-SUMMARY-RECORD-TEMP > 30
000000         MOVE 30 TO WS-SUMMARY-OVERTIME OF WS-SUMMARY-RECORD-T
000000-EMP
000000     END-IF.
000000     MOVE WS-SUMMARY-STAFF-NUMBER OF WS-SUMMARY-RECORD TO WS-S
000000-UMMARY-STAFF-NUMBER OF WS-SUMMARY-RECORD-TEMP.
000000     MOVE WS-SUMMARY-RECORD-TEMP TO SUMMARY-RECORD OF MONTHLY-
000000-OUTPUT-FILE.
000000     WRITE SUMMARY-RECORD OF MONTHLY-OUTPUT-FILE FROM WS-SUMMA
000000-RY-RECORD-TEMP.
000000*
000000*4TH
000000*GENERATE ATTENDENCE END
000000*******************************************
000000*******************************************
000000*5TH
000000*GENERATE SUMMARY
000000*
000000 MAKE-SUMMARY.
000000     PERFORM WRITE-SUMMARY.
000000     PERFORM LOOP-CONDITION.
000000 WRITE-SUMMARY.
000000     MOVE WS-STAFF-NUMBER  OF WS-EMPLOYEE-RECORD TO WS-STAFF-NUMBE
000000-R OF WS-REPORT-RECORD.
000000     MOVE WS-EMPLOYEE-LAST-NAME OF WS-EMPLOYEE-NAME  OF  WS-EMPLOY
000000-EE-RECORD TO WS-STAFF-LAST-NAME OF WS-STAFF-NAME OF WS-REPORT-REC
000000-ORD.
000000     MOVE WS-EMPLOYEE-FIRST-NAME OF WS-EMPLOYEE-NAME  OF  WS-EMPLO
000000-YEE-RECORD TO WS-STAFF-FIRST-NAME OF WS-STAFF-NAME OF WS-REPORT-R
000000-ECORD.
000000     MOVE WS-DEPARTMENT OF WS-EMPLOYEE-RECORD TO WS-STAFF-DEPARTME
000000-NT OF WS-REPORT-RECORD.
000000     IF WS-REPORT-STATUS-WRITTEN = 0
000000         IF WS-ATTENDANCE-SUSPICIOUS NOT = 0
000000             MOVE 'SUSPICIOUS' TO WS-STAFF-STATUS OF WS-REPORT-REC
000000-ORD
000000             MOVE 1 TO WS-REPORT-STATUS-WRITTEN
000000             ADD 1 TO SUSPICIOUS-COUNT GIVING SUSPICIOUS-COUNT
000000         END-IF
000000     END-IF.
000000     IF WS-REPORT-STATUS-WRITTEN = 0
000000         IF WS-ATTENDANCE-LATE NOT = 0
000000             MOVE 'LATE' TO WS-STAFF-STATUS OF WS-REPORT-RECORD
000000             MOVE 1 TO WS-REPORT-STATUS-WRITTEN
000000             ADD 1 TO LATE-COUNT GIVING LATE-COUNT
000000         END-IF
000000     END-IF.
000000     IF WS-REPORT-STATUS-WRITTEN = 0
000000         IF WS-ATTENDANCE-ABSENT NOT = 0
000000             MOVE 'ABSENT' TO WS-STAFF-STATUS OF WS-REPORT-RECORD
000000             MOVE 1 TO WS-REPORT-STATUS-WRITTEN
000000             ADD 1 TO ABSENT-COUNT GIVING ABSENT-COUNT
000000         END-IF
000000     END-IF.
000000     IF WS-REPORT-STATUS-WRITTEN = 0
000000         MOVE 'PRESENT' TO WS-STAFF-STATUS OF WS-REPORT-RECORD
000000         MOVE 1 TO WS-REPORT-STATUS-WRITTEN
000000         ADD 1 TO PRESENT-COUNT GIVING PRESENT-COUNT
000000     END-IF.
000000     WRITE SUMMARY-OUT FROM WS-REPORT-RECORD.
000000*
000000*5TH
000000*GENERATE SUMMARY END
000000*******************************************
000000*******************************************
000000*6TH
000000*LOOP CONDITION
000000*
000000 LOOP-CONDITION.
000000     READ EMPLOYEE-INPUT-FILE INTO WS-EMPLOYEE-RECORD.
000000*    DISPLAY '    NEXT EMPLOYEE:'WS-EMPLOYEE-RECORD.
000000*    DISPLAY '    EMPLOYEE FILE STATUS:'EMPLOYEE-FS.
000000     IF EMPLOYEE-FS NOT = WS-FILE-END AND EMPLOYEE-FS NOT = 46
000000         MOVE 0 TO WS-ATTENDANCE-START
000000         MOVE 0 TO WS-ATTENDANCE-END
000000         MOVE 0 TO WS-ATTENDANCE-LATE
000000         MOVE 0 TO WS-ATTENDANCE-OVERTIME
000000         MOVE 0 TO WS-REPORT-STATUS-WRITTEN
000000         PERFORM UPDATE-ATTENDANCE
000000     END-IF.
000000*
000000*6TH
000000*LOOP CONDITION END
000000*******************************************
000000*******************************************
000000*999TH
000000*PROPROCESS
000000*
000000 PROPROCESS.
000000     WRITE SUMMARY-OUT FROM SUMMERY-SEPERATOR.
000000     MOVE PRESENT-COUNT TO PRESENT-COUNT-REPORT OF SUMMERY-PRESENT
000000--COUNT.
000000     MOVE ABSENT-COUNT TO ABSENT-COUNT-REPORT OF SUMMERY-ABSENT-CO
000000-UNT.
000000     MOVE LATE-COUNT TO LATE-COUNT-REPORT OF SUMMERY-LATE-COUNT.
000000     MOVE SUSPICIOUS-COUNT TO SUSPICIOUS-COUNT-REPORT OF SUMMERY-S
000000-USPICIOUS-COUNT.
000000     WRITE SUMMARY-OUT FROM SUMMERY-PRESENT-COUNT.
000000     WRITE SUMMARY-OUT FROM SUMMERY-ABSENT-COUNT.
000000     WRITE SUMMARY-OUT FROM SUMMERY-LATE-COUNT.
000000     WRITE SUMMARY-OUT FROM SUMMERY-SUSPICIOUS-COUNT.
000000*
000000*999TH
000000*PROPROCESS END
000000*******************************************
